# 10_reduced the data_frame

In [16]:
import seaborn as sns
import pandas as pd

In [ ]:
df=sns.load_dataset('diamonds')
df.shape

In [ ]:
df.to_excel('dimond.xlsx')
df

In [ ]:
df.sample(frac=0.5).shape
df.info()

# 11_copy data from clipboard

In [ ]:
df=pd.read_clipboard()
df

# 12_split data_frame into two subsets

In [27]:
import seaborn as sns
import pandas as pd
df=sns.load_dataset('diamonds')
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [3]:
len(df)

53940

In [4]:
from random import random
df_1=df.sample(frac=0.50,random_state=1)
df_1.shape

(26970, 10)

In [5]:
df_2=df.drop(df_1.index)
df_2.shape

(26970, 10)

In [ ]:
df_1.head()

In [ ]:
df_2.head()

# 13_joing the data set

In [11]:
df1=len(df_1)+len(df_2)

53940



# 14_filtering the data frame

In [ ]:
df.head()

In [18]:
df.color.unique()

['E', 'I', 'J', 'H', 'F', 'G', 'D']
Categories (7, object): ['D', 'E', 'F', 'G', 'H', 'I', 'J']

In [ ]:
counts=df.table.value_counts()
top_3=counts.nlargest(3)
top_3

In [30]:
df[df.color.isin(counts.nlargest(3).index)].head()

Empty DataFrame
Columns: [carat, cut, color, clarity, depth, table, price, x, y, z]
Index: []

# 16_splinting string into multiple columns

In [ ]:
import pandas as pd 
df=pd.DataFrame({'Name':['aqsa','alisha','amrozy','rimsha','rani'],'RollNo':[34,23,56,67,89]})
df

# 17_aggregate by multiple functions and group

In [34]:
#import libaries
import pandas as pd 
import numpy as np
import seaborn as sns
#import data_set
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [35]:
df.groupby('sex').count()

C:\Users\aqso\AppData\Local\Temp\ipykernel_12120\2450831828.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male           157  157     157  157   157   157
Female          87   87      87   87    87    87

In [37]:
df.groupby('sex').sum

C:\Users\aqso\AppData\Local\Temp\ipykernel_12120\3833035379.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('sex').sum

In [39]:
len(df.sex)

244

In [41]:
len(df.groupby('sex'))

C:\Users\aqso\AppData\Local\Temp\ipykernel_12120\2409118562.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  len(df.groupby('sex'))

2

In [42]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
df.groupby(['sex','tip','time','size']).count()

# 18_specific rows and columns

In [ ]:
# select the columns 
df[['sex','size']]

In [ ]:
df.describe()

In [ ]:
df.describe().loc[['min','std','75%']]

In [ ]:
df.describe().loc['min':'max'] #specific rows

In [ ]:
df.describe().loc['min':'max','tip'] # rows with columns

# 19_ reshape multiple series

In [62]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [66]:
df.total_bill.mean()

np.float64(19.78594262295082)

In [67]:
df.groupby('sex').total_bill.mean()

C:\Users\aqso\AppData\Local\Temp\ipykernel_12120\2433186285.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('sex').total_bill.mean()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [ ]:
df.groupby(['sex','day']).total_bill.mean()

# 20_continous to catagorical data

In [71]:
df.total_bill.head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

In [83]:
pd.cut(df.total_bill,bins=[0,18,25,99],labels=["child","young","adult"]).head()

0    child
1    child
2    young
3    young
4    young
Name: total_bill, dtype: category
Categories (3, object): ['child' < 'young' < 'adult']

In [85]:
df['new_total_bill']=pd.cut(df.total_bill,bins=[0,18,25,99],labels=["child","young","adult"])
df.head()

   total_bill   tip     sex smoker  day    time  size new_total_bill
0       16.99  1.01  Female     No  Sun  Dinner     2          child
1       10.34  1.66    Male     No  Sun  Dinner     3          child
2       21.01  3.50    Male     No  Sun  Dinner     3          young
3       23.68  3.31    Male     No  Sun  Dinner     2          young
4       24.59  3.61  Female     No  Sun  Dinner     4          young

# 21_ one set_value into other one

In [ ]:
df['sex_num']=df.sex.map({'male': 0,'female': 1})
df.head()

   total_bill   tip     sex smoker  day    time  size new_total_bill  sex_num
0       16.99  1.01  Female     No  Sun  Dinner     2          child      NaN
1       10.34  1.66    Male     No  Sun  Dinner     3          child      NaN
2       21.01  3.50    Male     No  Sun  Dinner     3          young      NaN
3       23.68  3.31    Male     No  Sun  Dinner     2          young      NaN
4       24.59  3.61  Female     No  Sun  Dinner     4          young      NaN

In [90]:
df.day.unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [92]:
df['day_1']=df.day.factorize()[0]
df.head()

,total_bill,tip,sex,smoker,day,time,size,new_total_bill,sex_num,day_1
0,16.99,1.01,Female,No,Sun,Dinner,2,child,NaN,0
1,10.34,1.66,Male,No,Sun,Dinner,3,child,NaN,0
2,21.01,3.50,Male,No,Sun,Dinner,3,young,NaN,0
3,23.68,3.31,Male,No,Sun,Dinner,2,young,NaN,0
4,24.59,3.61,Female,No,Sun,Dinner,4,young,NaN,0